docs/design/VIEWS.0.md
```
digraph G {
  rankdir=LR;
  node [shape=box];
  subgraph cluster_g0 {
    label="team-identity";
    n_svc_auth [label="svc_auth"];
    n_svc_directory [label="svc_directory"];
  }
  subgraph cluster_g1 {
    label="team-payments";
    n_svc_ledger [label="svc_ledger"];
    n_svc_payments [label="svc_payments"];
    n_svc_risk [label="svc_risk"];
  }
  subgraph cluster_g2 {
    label="team-platform";
    n_svc_email [label="svc_email"];
    n_svc_gateway [label="svc_gateway"];
    n_svc_notify [label="svc_notify"];
  }
  n_svc_auth -> n_svc_directory [label="dependsOn"];
  n_svc_gateway -> n_svc_auth [label="dependsOn"];
  n_svc_gateway -> n_svc_payments [label="dependsOn"];
  n_svc_notify -> n_svc_email [label="dependsOn"];
  n_svc_payments -> n_svc_auth [label="dependsOn"];
  n_svc_payments -> n_svc_ledger [label="dependsOn"];
  n_svc_payments -> n_svc_notify [label="dependsOn"];
  n_svc_payments -> n_svc_risk [label="dependsOn"];
  n_svc_risk -> n_svc_directory [label="dependsOn"];
}
```
